#include <iostream>
#include "Fraction.h"

using namespace std;

/*3. Создать класс: Fraction (дробь). Дробь имеет числитель и знаменатель (например, 3/7 или 9/2). 
Предусмотреть, чтобы знаменатель не был равен 0. 
Перегрузить:
математические бинарные операторы (+, -, *, /) для выполнения действий с дробями
унарный оператор (-)
логические операторы сравнения двух дробей (==, !=, <, >, <=, >=).

Примечание: Поскольку операторы < и >=, > и <= — это логические противоположности, попробуйте перегрузить один через другой.

Продемонстрировать использование перегруженных операторов.*/

int main()
{            
    Fraction a(1, 2), b(1, 3), c(5), d;

    cout << "------------- 1 ------------- " << endl <<
        "a: " << a << endl <<
        "b: " << b << endl <<
        "c: " << c << endl <<
        "d: " << d << endl;

    cout << "b <m_numerator> <m_denominator>: ";
    cin >> b;

    d = 2 * a / b;
    c = d * 1;

    cout << "------------- 2 ------------- " << endl <<
        "a: " << a << endl <<
        "b: " << b << endl <<
        "c: " << c << endl <<
        "d: " << d << endl;
    if (d == c)
    {
        cout << "d == c" << endl;
    }
    else
    {
        cout << "NOT d == c" << endl;
    }
    a = a - d;
    c /= -d;

    cout << "------------- 3 ------------- " << endl <<
        "a: " << a << endl <<
        "b: " << b << endl <<
        "c: " << c << endl <<
        "d: " << d << endl;
    b = --c;
    cout << "------------- 4 ------------- " << endl <<
        "a: " << a << endl <<
        "b: " << b << endl <<
        "c: " << c << endl <<
        "d: " << d << endl;
    b = d--;

    cout << "------------- 5 ------------- " << endl <<
        "a: " << a << endl <<
        "b: " << b << endl <<
        "c: " << c << endl <<
        "d: " << d << endl;
    if (a < c)
    {
        cout << "a < c" << endl;
    }
    else
    {
        cout << "NOT a < c" << endl;
    }
    if (d < d)
    {
        cout << "d < d" << endl;
    }
    else
    {
        cout << "NOT d < d" << endl;
    }
    if (d <= d)
    {
        cout << "d <= d" << endl;
    }
    else
    {
        cout << "NOT d <= d" << endl;
    }

    return 0;
}




